wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
// in caso di DONGLE
// 0 = non stabilita
// 1 = arrivata richiesta broadcast di connessione
// 2 = accettata ed inviata richiesta di connessione
// 3 = arrivara accettazione di connessione

const uint8_t BROADCAST_ADDR[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

#if defined(DONGLE)
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast
  const functionPtr callbackArr[] = { packet_callback_read_dongle };
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastPedalAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  uint8_t lastPedalChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // se true significa che abbiamo un indirizzo dell'ultimo dongle altrimenti false
  bool lastPedalSave = false; 
#elif defined(PEDAL)
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast
  const functionPtr callbackArr[] = { packet_callback_read_pedal };
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastPedalAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  uint8_t lastPedalChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // se true significa che abbiamo un indirizzo dell'ultimo dongle altrimenti false
  bool lastPedalSave = false; 
#elif defined(GUN)
  uint8_t peerAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF}; // broadcast
  const functionPtr callbackArr[] = { packet_callback_read_gun };
  uint8_t lastDongleAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastPedalAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  uint8_t lastDongleChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  uint8_t lastPedalChannel = OPENFIRE_ESPNOW_WIFI_CHANNEL;
  bool lastDongleSave = false; // se true significa
  bool lastPedalSave = false; // se true significa
  // ==========================================================================================================
#endif

// ========= per gestione PEDAL ===========
uint8_t peerAddress_pedal[6] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00}; // broadcast
#define MAX_TIMEOUT_LAST_PACKET (uint64_t)100000   // = 100  ms  .. il valore va specificato in microsecondi
void setupTimerPedal();
esp_timer_handle_t timer_handle_pedal;
// ===================================================

// ===================================================================================
// HARDWARE SETTINGS: FREQUENZA RADIO E PHY
// ===================================================================================
///////////////////////////////////////////////////////////////////
// Definizione globale della configurazione del rate
esp_now_rate_config_t rate_config = {
    .phymode = WIFI_PHY_MODE_11G, // Forza lo standard G (Miglior compromesso penetrazione/velocità)
    .rate = WIFI_PHY_RATE_12M,    // Forza i 12 Mbps (Garantisce stabilità del link a discapito della banda larga non necessaria)
    .ersu = false,                // Non necessario per 11g
    .dcm = false                  // Non necessario per 11g
};
////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////

volatile uint8_t channel_display = espnow_wifi_channel;

#if defined(DONGLE) && defined(USES_OLED_DISPLAY)
/** 0 = WiFi AP scan phase; 1–13 = per-channel RF sniff in findBestChannel() */
volatile uint8_t dongle_oled_sniff_channel = 0;
#endif
volatile uint8_t seconds_display = 30;
volatile bool broadcast_receiver = false;  

// ===================================================================================
// TASKS ASINCRONI FREERTOS (USB E RADIO)
// ===================================================================================

//////////////////////////////////////////////////////////////////////////////
TaskHandle_t xUSBTaskHandle = NULL;
#ifdef DONGLE

// Il task USB gestisce l'invio dei dati HID al PC garantendo che l'Endpoint non 
// venga mai saturato. Utilizza un algoritmo Round-Robin per dare priorità a rotazione 
// tra Mouse, Tastiera e Gamepad, evitando che periferiche "loquaci" (come il mouse) 
// oscurino gli altri controlli.

void usbTask(void *pvParameters) {
  // Teniamo traccia di chi ha il turno. 
  // 0 = Mouse, 1 = Tastiera, 2 = Gamepad
  static int currentRotation = 0; 

  for (;;) {
    // 1. METTI IN PAUSA IL TASK
    // Si sveglierà istantaneamente se:
    // - La radio riceve un dato nuovo (il tuo xTaskNotifyGive)
    // - La USB ha finito di trasmettere (la callback tud_hid_report_complete_cb)
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

    // 2. CONTROLLO HARDWARE
    // Procediamo solo se l'Endpoint HID è fisicamente libero
    if (usbHid.ready()) {

      // 3. ROTAZIONE ROUND-ROBIN
      // Facciamo un ciclo di massimo 3 tentativi per trovare il primo dispositivo con dati pendenti
      for (int i = 0; i < 3; i++) {
        int target = (currentRotation + i) % 3;

        // --- TURNO 0: MOUSE ---
        if (target == 0 && absmouse5Report_pending) {
          if (usbHid.sendReport(HID_RID_e::HID_RID_MOUSE, &absmouse5Report_last_wifi, sizeof(absmouse5Report_last_wifi))) {
            absmouse5Report_pending = false; // Dato smaltito
            currentRotation = 1;            // Prossimo giro tocca alla Tastiera
            break; // IMPORTANTE: Usciamo dal for. Il buffer USB ora è pieno.
          }
        }
        
        // --- TURNO 1: TASTIERA ---
        else if (target == 1 && keyReport_pending) {
          if (usbHid.sendReport(HID_RID_e::HID_RID_KEYBOARD, &keyReport_last_wifi, sizeof(keyReport_last_wifi))) {
            keyReport_pending = false; 
            currentRotation = 2;            // Prossimo giro tocca al Gamepad
            break; 
          }
        }
        
        // --- TURNO 2: GAMEPAD ---
        else if (target == 2 && gamepad16Report_pending) {
          if (usbHid.sendReport(HID_RID_e::HID_RID_GAMEPAD, &gamepad16Report_last_wifi, sizeof(gamepad16Report_last_wifi))) {
            gamepad16Report_pending = false;
            currentRotation = 0;            // Prossimo giro si riparte dal Mouse
            break; 
          }
        }
        
      } // Fine del ciclo for
    }
    // Se arriviamo qui (che la USB fosse occupata o che abbiamo inviato un report),
    // il task finisce il giro e torna a dormire all'inizio del for(;;)
  }
}
#endif // DONGLE
/////////////////////////////////////////////////////////////////////////////

TaskHandle_t xRadioTaskHandle = NULL;
volatile bool radioFree = true;

// Il task della Radio è il controllore del traffico. Rimane "addormentato" fino
// a quando non riceve una notifica (ISR ESP-NOW o Timer Seriale).
// Gestisce sia il Parsing dei pacchetti in arrivo (scavalcando la FSM), 
// sia l'emissione dei pacchetti in coda verso l'etere.

void radioTask(void *pvParameters) {
  while (1) {
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    
    bool progress;
    
    do {
      progress = false;

      // 1. GESTIONE RICEZIONE (Invariata)
      if (SerialWireless._reader != SerialWireless._writer) {
        SerialWireless.checkForRxPacket();
        progress = true;
      }

      // 2. GESTIONE SERIALE -> RECOVERY MODE!
      // Interveniamo SOLO se il timer ha fallito in precedenza
      if (SerialWireless._serial_needs_recovery && (SerialWireless.availableBufferSerialWrite() > 0)) {
        if (SerialWireless.flush_sem()) {
          // Salvataggio riuscito! Abbassiamo la bandierina.
          // SerialWireless._serial_needs_recovery = false; // flush_sem() lo fa già da sola prima di restituire true.
          progress = true; 
        }
      }

      // 3. GESTIONE TRASMISSIONE RADIO (Invariata)
      if (radioFree && (SerialWireless.readIndex != SerialWireless.writeIndex)) {
        SerialWireless.SendData_sem();
        progress = true;
      }

    } while (progress); 
  } 
}
// =====================================

// ===================================================================================
// ANIMAZIONI GRAFICHE ASINCRONE (DISPLAY TFT/OLED)
// ===================================================================================
// Queste funzioni sono lanciate su Core separati durante le fasi "bloccanti" di rete 
// per garantire che lo schermo sia fluido e reattivo, fornendo un chiaro feedback
// visuale sull'accoppiamento all'utente (UX Pattern).

/////////////////////////////////////////////////////////////////////////////
// VERSIONE GRAFICA RICERCA CANALE PER GUN //////////////////////////////////
/////////////////////////////////////////////////////////////////////////////

#if defined(GUN) && defined(USES_DISPLAY)
void animTaskLink_pedal(void *pvParameters) {
  const char* rotazione = "-\\|/-\\|/";
  int8_t rotazioneIndex = 0;
  const uint8_t baseX = 1;
  const uint8_t baseY = 2;
  const uint8_t charWidth = 6;
  uint8_t seconds_tread = seconds_display;
  
  // Setup iniziale display
  display_OLED->setCursor(baseX, baseY);
  display_OLED->setTextSize(1);
  display_OLED->setTextColor(WHITE, BLACK);
  display_OLED->fillRect(0, 0, 128, 16, BLACK);
  display_OLED->drawFastHLine(0, 15, 128, WHITE);
  char buffer[30];
  sprintf(buffer, "Search Pedal [%2ds]", seconds_tread);                  
  display_OLED->print(buffer);
  display_OLED->display();

  // Loop del task
  for (;;) {
    if (seconds_display != seconds_tread)
    {
      display_OLED->setCursor((14*6)+1, 2);
      seconds_tread = seconds_display;
      sprintf(buffer, "%2d", seconds_tread);
      display_OLED->print(buffer);
    }
    display_OLED->setCursor(baseX + (19 * charWidth), baseY);
    display_OLED->write(rotazione[rotazioneIndex]);
    rotazioneIndex = (rotazioneIndex + 1) % 8;
    display_OLED->display();
    vTaskDelay(pdMS_TO_TICKS(150)); // piccolo delay per non saturare la CPU
  } 
}
#endif // GUN



#if defined(GUN) && defined(USES_DISPLAY)
void animTaskLink(void *pvParameters) {
  const char* rotazione = "-\\|/-\\|/";
  int8_t rotazioneIndex = 0;
  const uint8_t baseX = 1;
  const uint8_t baseY = 2;
  const uint8_t charWidth = 6;
  uint8_t channel_tread = espnow_wifi_channel;
  
  // Setup iniziale display
  display_OLED->setCursor(baseX, baseY);
  display_OLED->setTextSize(1);
  display_OLED->setTextColor(WHITE, BLACK);
  display_OLED->fillRect(0, 0, 128, 16, BLACK);
  display_OLED->drawFastHLine(0, 15, 128, WHITE);
  char buffer[30];
  sprintf(buffer, "Ch:%2d Waiting link", channel_tread);
  display_OLED->print(buffer);
  display_OLED->display();

  // Loop del task
  for (;;) {
    if (channel_display != channel_tread)
    {
      display_OLED->setCursor(19, 2);
      channel_tread = channel_display;
      sprintf(buffer, "%2d", channel_tread);
      display_OLED->print(buffer);
    }
    display_OLED->setCursor(baseX + (19 * charWidth), baseY);
    display_OLED->write(rotazione[rotazioneIndex]);
    rotazioneIndex = (rotazioneIndex + 1) % 8;
    display_OLED->display();
    vTaskDelay(pdMS_TO_TICKS(150)); // piccolo delay per non saturare la CPU
  } 
}
#endif // GUN



/////////////////////////////////////////////////////////////////////////////
// FINE VERSIONE GRAFICA RICERCA CANALE PER GUN /////////////////////////////
/////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////
// VERSIONE GRAFICA RICERCA CANALE PER DONGLE ///////////////////////////////
/////////////////////////////////////////////////////////////////////////////

