wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  #if defined(DONGLE) && defined(USES_DISPLAY)
    if (animTaskHandle != NULL) {
      vTaskDelete(animTaskHandle);
      animTaskHandle = NULL;
    }
  #endif // USES_DISPLAY
  
  return bestCh;
}
#endif // DONGLE
// ================= FINE FUNZIONI PER RICERCA MIGLIORE CANALE - USATO SOLO DAL DONGLE =========================

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/*****************************
 *   SERIAL WIRELESS SECTION
 *****************************/
// ===================================================================================
// INTERFACCIA STREAM: ASTRAZIONE DELLA RADIO COME PORTA SERIALE VIRTUALE
// ===================================================================================
// Questi metodi sovrascrivono l'interfaccia standard `Stream` di Arduino. 
// L'obiettivo architettonico è permettere al resto del codice (es. logica di parsing 
// o librerie esterne) di leggere e scrivere dati dalla/verso la rete ESP-NOW 
// esattamente come se fosse una normale connessione seriale via cavo.
// La latenza è mascherata dall'uso di buffer circolari (Ring Buffers) e indici Lock-Free.

SerialWireless_::operator bool() {
  return true;
}

int SerialWireless_::peek() {
  if (_writerSerialRead == _readerSerialRead) return -1;
  return bufferSerialRead[_readerSerialRead];
}

int SerialWireless_::peekBin() {
  if (writeIndex == readIndex) return -1;
  return buffer[readIndex];
}

// Estrae un singolo byte dal buffer circolare di ricezione. 
// L'uso dell'operatore bitwise (& MASK_READ_SERIAL) sostituisce il costoso operatore modulo (%),
// garantendo il wrap-around dell'indice in un singolo ciclo di clock.
int SerialWireless_::read() {
  uint16_t r = _readerSerialRead;
  if (r == _writerSerialRead) return -1;

  uint8_t ret = bufferSerialRead[r];
  _readerSerialRead = (r + 1) & MASK_READ_SERIAL;
  return (int)ret;
}

int SerialWireless_::readBin() {
  uint16_t r = _reader;
  uint16_t w = _writer;

  if (r == w) return -1;
  uint8_t ret = _queue[r];

  const uint16_t MASK = FIFO_SIZE_READ - 1;
  _reader = (r + 1) & MASK;
  return (int)ret;
}

// ===================================================================================
// MOTORE DI PARSING ASINCRONO E GESTIONE MEMORIA LOCK-FREE
// ===================================================================================

// Questa funzione viene chiamata dal `radioTask`. Ispeziona la coda dati grezzi 
// (riempita dalla ISR della radio) e la passa istantaneamente alla macchina a stati 
// del protocollo COBS (`packet.parse`).
bool SerialWireless_::checkForRxPacket() {
    // 1. Snapshot locale degli indici in questo preciso istante
    // Questo è il cuore del pattern Lock-Free: leggiamo lo stato corrente senza bloccare 
    // l'hardware interrupt che potrebbe star scrivendo contemporaneamente.
    uint16_t r = _reader;
    uint16_t w = _writer; // Guardiamo dove è arrivata la callback ESP-NOW
    const uint16_t MASK = FIFO_SIZE_READ - 1;

    // 2. Calcolo Lock-Free dei dati disponibili
    // Questa formula gestisce il wrap-around da sola in un ciclo di clock
    uint16_t available = (w - r) & MASK;
    
    // Uscita rapida se non c'è nulla da leggere
    if (available == 0) return false;

    // 3. Cache locale per massime prestazioni
    uint8_t* queuePtr = _queue;

    // 4. Ciclo di "svuotamento" rapido e Parsing
    for (uint16_t i = 0; i < available; i++) {
        uint8_t dato = queuePtr[r];
        
        // Il parser lavora in tempo reale.
        packet.parse(dato, true); 

        // Avanzamento con wrap-around bitwise
        r = (r + 1) & MASK;
    }

    // --- BARRIERA DEL COMPILATORE ---
    // Essenziale sulle architetture Xtensa/ARM: Assicura che la CPU finisca 
    // fisicamente di trasferire tutti i byte dalla RAM cacheata alla RAM principale
    // PRIMA di dire all'ISR (Interrupt Service Routine) che lo spazio è di nuovo libero. 
    asm volatile ("memw" : : : "memory");

    // 5. Sincronizzazione finale ATOMICA
    // Aggiorniamo _reader in RAM una sola volta. Appena viene eseguita questa riga,
    // la callback RX capisce matematicamente che c'è nuovo spazio libero per scrivere.
    _reader = r;

    return true;
}

int SerialWireless_::available() {
  // Distanza tra chi scrive e chi legge
  return (_writerSerialRead - _readerSerialRead) & MASK_READ_SERIAL;
}

int SerialWireless_::availableBin() {
  return (writeIndex - readIndex) & (BUFFER_SIZE - 1);
}

// Quanti byte LIBERI rimangono nel buffer (Standard Arduino API)
int SerialWireless_::availableForWrite() {
  return (_readerSerialWrite - _writerSerialWrite - 1) & MASK_WRITE_SERIAL;
}

// funzione di comodo
// Quanti byte sono attualmente nel buffer in attesa di essere inviati
int SerialWireless_::availableBufferSerialWrite() {
  return (_writerSerialWrite - _readerSerialWrite) & MASK_WRITE_SERIAL;
}

int SerialWireless_::availableForWriteBin() {
  return (readIndex - writeIndex - 1) & (BUFFER_SIZE - 1);
}

// ===================================================================================
// TRASMISSIONE DATI: PRODUCER-CONSUMER PATTERN
// ===================================================================================

// In una seriale hardware, `flush` blocca il thread finché l'ultimo bit non lascia il pin TX. 
// Qui invece il flush impacchetta i dati nel ring buffer e "sveglia" il task radio. 
// Se il buffer di rete è saturo, usiamo taskYIELD per cedere volontariamente il controllo 
// al sistema operativo (FreeRTOS) permettendo al task radio di trasmettere e liberare spazio, 
// prevenendo così i Watchdog Timeout e mantenendo il sistema responsivo.
void SerialWireless_::flush() {
  // 1. Il flush deve attendere finché ci sono dati nel buffer di scrittura seriale
  while (availableBufferSerialWrite() > 0) {
    
    // 2. Chiamiamo flush_sem(). 
    // Non serve prendere il Mutex qui perché flush_sem() al suo interno 
    // usa già lo Spinlock (portENTER_CRITICAL) per proteggere i puntatori.
    if (!flush_sem()) {
      // Se flush_sem() restituisce false, significa che il buffer RADIO è pieno.
      // Dobbiamo dare tempo al radioTask di trasmettere per liberare spazio.
      taskYIELD(); 
    }
    
    // Un piccolo respiro per non "sequestrare" il Core se il buffer è molto grande
    taskYIELD(); 
  }
}

// Fase di preparazione: Preleva i dati seriali in attesa, applica lo stuffing COBS, 
// incapsula il tutto in un pacchetto con ID e CRC, e lo deposita nel buffer pronto 
// per essere spedito in etere.
bool SerialWireless_::flush_sem() {
  bool packed_data = false;
  
  // 1. Lucchetto Seriale
  portENTER_CRITICAL(&mux_serial_tx);

  uint16_t w = _writerSerialWrite;
  uint16_t r = _readerSerialWrite;
  uint16_t available_tx = (w - r) & MASK_WRITE_SERIAL;

