wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  if (available_tx > 0) {
    // 2. LUCCHETTO RADIO PRIMA DI CONTARE LO SPAZIO!
    // Ora nessuno può rubarci lo spazio mentre calcoliamo il pacchetto
    portENTER_CRITICAL(&mux_radio_tx);

    uint16_t space_in_radio = availableForWriteBin();
    const uint16_t overhead = PREAMBLE_SIZE + POSTAMBLE_SIZE;

    if (space_in_radio > overhead) {
      uint16_t max_payload = space_in_radio - overhead;
      
      // Strategia di frammentazione dinamica:
      // Se i dati superano il limite fisico di un singolo pacchetto ESP-NOW o la capacità 
      // del payload (200 byte per sicurezza), spezziamo l'invio in chunk più piccoli.
      uint16_t len_to_pack = std::min((uint16_t)available_tx, std::min((uint16_t)200, max_payload));

      uint16_t firstChunk = FIFO_SIZE_WRITE_SERIAL - r;
      if (firstChunk < len_to_pack) {
        memcpy(&packet.txBuff[PREAMBLE_SIZE], &bufferSerialWrite[r], firstChunk);
        memcpy(&packet.txBuff[PREAMBLE_SIZE + firstChunk], &bufferSerialWrite[0], len_to_pack - firstChunk);
      } else {
        memcpy(&packet.txBuff[PREAMBLE_SIZE], &bufferSerialWrite[r], len_to_pack);
      }

      packet.constructPacket(len_to_pack, PACKET_TX::SERIAL_TX);
      
      writeBin(packet.txBuff, len_to_pack + overhead);
      
      _readerSerialWrite = (r + len_to_pack) & MASK_WRITE_SERIAL;
      packed_data = true;
    }
    
    // Rilasciamo la radio
    portEXIT_CRITICAL(&mux_radio_tx);
  }

  // Rilasciamo la seriale
  portEXIT_CRITICAL(&mux_serial_tx); 

  // API di sistema
  // Segnaliamo al Task Radio asincrono che ci sono nuovi pacchetti pronti al decollo.
  if (packed_data) {
    esp_timer_stop(timer_handle_serial);
    xTaskNotifyGive(xRadioTaskHandle);
    _serial_needs_recovery = false;
    return true;
  }

  return false; 
}

// Fase di lancio: Questa funzione "spinge" fisicamente i bit nell'hardware radio ESP-NOW.
void SerialWireless_::SendData_sem() {
  // 1. Snapshot locale degli indici
  const uint16_t r = readIndex;
  const uint16_t w = writeIndex; // Guardiamo dove è arrivato il produttore in questo istante
  const uint16_t MASK = BUFFER_SIZE - 1;

  // 2. Calcolo Lock-Free dei dati disponibili
  // Questa formula gestisce il wrap-around automaticamente
  const uint16_t available_data = (w - r) & MASK;

  // 3. Uscita rapida se non c'è nulla da spedire
  if (available_data == 0) return;

  uint16_t len_tx = available_data;

  // 4. ALLINEAMENTO PACCHETTI (Prevenzione "taglio")
  // ESP-NOW ha un limite hardware rigido di 250 byte per payload.
  // Se tronchiamo un frame a metà distruggiamo il protocollo COBS in ricezione.
  // Pertanto, analizziamo il buffer a ritroso cercando un byte terminatore (0xFF) 
  // e allineiamo il taglio garantendo l'invio di pacchetti logicamente integri.
  if (available_data > ESP_NOW_MAX_DATA_LEN) {
    uint16_t aligned_len = 0;
    
    // Scansione a ritroso dal limite fisico.
    for (uint16_t i = ESP_NOW_MAX_DATA_LEN; i > 0; i--) {
      if (buffer[(r + i) & MASK] == START_BYTE) {
        aligned_len = i; 
        break;
      }
    }

    len_tx = (aligned_len > 0) ? aligned_len : ESP_NOW_MAX_DATA_LEN;
  }

  // 5. COPIA BATCH
  const uint16_t firstChunk = BUFFER_SIZE - r;
  
  if (firstChunk < len_tx) {
    const uint16_t secondChunk = len_tx - firstChunk;
    memcpy(buffer_espnow, &buffer[r], firstChunk);
    memcpy(&buffer_espnow[firstChunk], &buffer[0], secondChunk);
  } else {
    memcpy(buffer_espnow, &buffer[r], len_tx);
  }

// 6. INVIO E AGGIORNAMENTO
  esp_err_t result = esp_now_send(peerAddress, buffer_espnow, len_tx);
  
  if (result == ESP_OK) {
    radioFree = false; 
    
    // Aggiornamento ATOMICO
    readIndex = (r + len_tx) & MASK; 
  } else {
    // IL FREEZE SANO:
    // L'invio è fallito (es. peer spento/interferenza).
    // Non avanziamo readIndex per non perdere i dati seriali vitali.
    // Ma diamo 1 ms di pausa al sistema per non far intervenire il Watchdog
    // e prevenire un riavvio forzato della Lightgun.
    vTaskDelay(pdMS_TO_TICKS(1));
  }
}

size_t SerialWireless_::write(uint8_t c) {
  return write(&c, 1);
}

size_t SerialWireless_::writeBin(uint8_t c) {
  return writeBin(&c, 1);
}

size_t SerialWireless_::write(const uint8_t *data, size_t len) {
  size_t written = 0;
  bool start_timer = false; // Flag di sicurezza

  while (written < len) {
    start_timer = false; // Resettiamo a ogni ciclo
    
    portENTER_CRITICAL(&mux_serial_tx); // --- INIZIO LOCK ---

    uint16_t w = _writerSerialWrite;
    uint16_t r = _readerSerialWrite;
    uint16_t free_space = (r - w - 1) & MASK_WRITE_SERIAL;

    if (free_space > 0) {
      size_t toWrite = std::min((size_t)free_space, len - written);
      uint16_t firstChunk = FIFO_SIZE_WRITE_SERIAL - w;
      
      if (firstChunk < toWrite) {
        memcpy(&bufferSerialWrite[w], &data[written], firstChunk);
        memcpy(&bufferSerialWrite[0], &data[written + firstChunk], toWrite - firstChunk);
      } else {
        memcpy(&bufferSerialWrite[w], &data[written], toWrite);
      }

      if (w == r) {
        start_timer = true; // Alziamo la flag invece di chiamare l'API
      }

      asm volatile ("memw" : : : "memory");
      _writerSerialWrite = (w + toWrite) & MASK_WRITE_SERIAL;
      
      portEXIT_CRITICAL(&mux_serial_tx); // --- FINE LOCK ---

      // Ora siamo al sicuro: avviamo il timer se necessario!
      // Usiamo un timer hardware per garantire che anche piccoli payload (che non 
      // saturano il buffer) vengano flushati regolarmente senza rimanere incastrati.
      if (start_timer) {
        esp_timer_start_once(timer_handle_serial, TIMER_HANDLE_SERIAL_DURATION_MICROS);
      }

      written += toWrite;
      xTaskNotifyGive(xRadioTaskHandle);
    } 
    else {
      portEXIT_CRITICAL(&mux_serial_tx);
      
      if (!flush_sem()) {
        taskYIELD(); 
      }
    }
  }
  return written;
}

size_t SerialWireless_::writeBin(const uint8_t *data, size_t len) {
  // 1. Usa lo stesso lucchetto di SendPacket per coerenza e velocità
  // Un mutex hardware disabilita gli interrupt momentaneamente: usiamolo
  // per il minimo tempo indispensabile.
  portENTER_CRITICAL(&mux_radio_tx);

  uint16_t w = writeIndex;
  uint16_t r = readIndex;
  const uint16_t MASK = BUFFER_SIZE - 1;

  // 2. Calcolo dello spazio (Regola del Meno Uno) - PERFETTO
  uint16_t free_space = (r - w - 1) & MASK;

  if (free_space < len) {
    _overflow_write = true;
    portEXIT_CRITICAL(&mux_radio_tx); 
    return 0; 
  }

  // 3. COPIA BATCH (Wrap-around logic) - PERFETTA
  uint16_t firstChunk = BUFFER_SIZE - w;

  if (firstChunk < len) {
    memcpy(&buffer[w], data, firstChunk);
    memcpy(&buffer[0], data + firstChunk, len - firstChunk);
  } else {
    memcpy(&buffer[w], data, len);
  }

