wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  // 4. BARRIERA DI MEMORIA - Fondamentale per ESP32/Xtensa
  asm volatile ("memw" : : : "memory");

  // 5. Aggiornamento dell'indice - Atomico
  writeIndex = (w + len) & MASK; 

  portEXIT_CRITICAL(&mux_radio_tx);

  return len;
}

void SerialWireless_::SendPacket(const uint8_t *data, uint8_t len, uint8_t packetID) { 
  const uint16_t totalLen = len + PREAMBLE_SIZE + POSTAMBLE_SIZE;

  // 1. Entriamo in sezione critica (Spinlock hardware)
  // Velocissimo, protegge il "tavolo da lavoro" packet.txBuff da altri Core o Task
  portENTER_CRITICAL(&mux_radio_tx);

  // 2. Snapshot Lock-Free dello spazio disponibile
  uint16_t w = writeIndex;
  uint16_t r = readIndex;
  const uint16_t MASK = BUFFER_SIZE - 1;
  uint16_t free_space = (r - w - 1) & MASK; 

  // 3. Se c'è spazio, costruiamo e scriviamo subito
  if (free_space >= totalLen) {
    uint8_t* pDest = packet.txBuff;

    // Copiamo i dati e costruiamo il pacchetto nel buffer temporaneo
    memcpy(&pDest[PREAMBLE_SIZE], data, len);
    packet.constructPacket(len, packetID);
    
    // Inseriamo nel Ring Buffer principale
    // (Dato che siamo già in sezione critica, writeBin sarà un fulmine)
    writeBin(pDest, totalLen);
    
    // Usciamo dalla sezione critica prima di notificare
    portEXIT_CRITICAL(&mux_radio_tx);

    // 4. Svegliamo il radioTask
    xTaskNotifyGive(xRadioTaskHandle);
  } 
  else {
    portEXIT_CRITICAL(&mux_radio_tx);
    _overflow_write = true;
  }
}

void SerialWireless_::write_on_rx_serialBuffer(const uint8_t *data, int len) {
  uint16_t w = _writerSerialRead;
  uint16_t r = _readerSerialRead;
  
  // Calcolo spazio libero (Regola del Meno Uno)
  uint16_t free_space = (r - w - 1) & MASK_READ_SERIAL;

  if (free_space >= len) {
    uint16_t firstChunk = FIFO_SIZE_READ_SERIAL - w;
    if (firstChunk < len) {
      memcpy(&bufferSerialRead[w], data, firstChunk);
      memcpy(&bufferSerialRead[0], data + firstChunk, len - firstChunk);
    } else {
      memcpy(&bufferSerialRead[w], data, len);
    }
    
    // Barriera di memoria prima di aggiornare il puntatore
    asm volatile ("memw" : : : "memory");
    _writerSerialRead = (w + len) & MASK_READ_SERIAL;
  } else {
    _overflow_bufferSerialRead = true;
  }
}

bool SerialWireless_::end() {

  vTaskDelete(xRadioTaskHandle);
  // vTaskDelete(xUSBTaskHandle); // questo va solo nel dongle
  
  esp_err_t err = esp_now_deinit();
  if (err != ESP_OK) {
    //Serial.printf("esp_now_deinit failed! 0x%x", err);
    return false;
  }
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF); // Disattiva il WiFi
  esp_timer_delete(timer_handle_serial);
  return true;
}


void SerialWireless_::init_wireless() {
  configST myConfig; // variabile di utilità per configurazione
  
  myConfig.timeout      = DEFAULT_TIMEOUT; // 50ms
  myConfig.callbacks    = callbackArr;
  myConfig.callbacksLen = sizeof(callbackArr) / sizeof(functionPtr);
  packet.begin(myConfig);

  setupTimerSerial(); // crea i timer .. timer per invio dati seriali

  // ========= AGGIUNTA PER NUOVA GESTIONE TRASMISSIONE RICEZIONE RADIO X TUTTI===============
  xTaskCreatePinnedToCore(
        radioTask,          // funzione del task
        "radioTask",        // nome
        4096,              // stack size
        NULL,              // parametri
        15,                 // priorità ALTA DA 1 A 24 ?
        &xRadioTaskHandle,   // handle
        APP_CPU_NUM        // core (puoi usare 0 o 1)
      );
  // ========== FINE AGGIUNTA PER NUOVA GESTIONE =================

  #ifdef DONGLE
  // ========= AGGIUNTA PER NUOVA GESTIONE DONGLE USB (SERVE SOLO AL DONGLE) ===============
  xTaskCreatePinnedToCore(
        usbTask,          // funzione del task
        "usbTask",        // nome
        4096,              // stack size
        NULL,              // parametri
        10,                 // priorità ALTA DA 1 A 24 ?
        &xUSBTaskHandle,   // handle
        APP_CPU_NUM        // core (puoi usare 0 o 1) APP_CPU_NUM = 1 (dove gira il loop) PRO_CPU_NUM = 0 (dove gira freertos, wifi, ecc.)
      );
  // ========== FINE AGGIUNTA PER NUOVA GESTIONE =================
  #endif // DONGLE

}


void SerialWireless_::begin() {

  #ifdef GUN
    if (lastDongleSave) espnow_wifi_channel=lastDongleChannel;
      else espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
  #endif //GUN

  #ifdef DONGLE
    
      #ifdef OPENFIRE_AUTO_CHANNEL_ESPNOW_WIFI
        espnow_wifi_channel = findBestChannel(); //12;             
      #else
        espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
      #endif // OPENFIRE_AUTO_CHANNEL_ESPNOW_WIFI
     
  #endif // DONGLE

#ifdef DONGLE
  channel_display = espnow_wifi_channel;
#endif

#if defined(DONGLE) && defined(USES_OLED_DISPLAY)
  dongle_oled_draw_link_status();
#endif

  #ifdef PEDAL
      espnow_wifi_channel=OPENFIRE_ESPNOW_WIFI_CHANNEL;
  #endif //GUN


  WiFi.mode(WIFI_STA); 
  WiFi.disconnect();
  

  esp_err_t err = esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11G); // | WIFI_PROTOCOL_11N);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_protocol failed! 0x%x", err);
  }
  
  err = esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT20);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_bandwidth failed! 0x%x", err);
  }
  
  err = esp_wifi_get_mac(WIFI_IF_STA, mac_esp_inteface);
  if (err != ESP_OK) {
    //Serial.println("Failed to read MAC address");
  }
  
  esp_wifi_set_promiscuous(true);
  err = esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_channel failed! 0x%x", err);
  }
  esp_wifi_set_promiscuous(false);

  err = esp_wifi_set_max_tx_power(espnow_wifi_power); // tra 8 e 84 corrispondenti a 2dbm a 20 dbm);
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_max_tx_power failed! 0x%x", err);
  }

  err = esp_wifi_set_ps(WIFI_PS_NONE);  // DISABILITA IL POWER SAVE PER MASSIMA REATTIVITà
  if (err != ESP_OK) {
    //Serial.printf("esp_wifi_set_ps failed! 0x%x", err);
  }
  
  vTaskDelay(pdMS_TO_TICKS(500)); // delay(1000);
    
  err = esp_now_init();
  if (err != ESP_OK) {
    //Serial.printf("esp_now_init failed! 0x%x", err);
  }
    
  if (lastDongleSave) {
    memcpy(peerAddress, lastDongleAddress,6);
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION_DONGLE;
  } else {
    memcpy(peerAddress, BROADCAST_ADDR, 6);
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  }
  
