wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  peerInfo.channel = espnow_wifi_channel;
  peerInfo.encrypt = false;
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    //Serial.println("Errore nell'aggiunta del peer");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

  err = esp_now_register_recv_cb(_esp_now_rx_cb);
  if (err != ESP_OK) {
    //Serial.printf("esp_now_register_recv_cb failed! 0x%x", err);
  }

  err = esp_now_register_send_cb(_esp_now_tx_cb);
  if (err != ESP_OK) {
    //Serial.printf("esp_now_register_send_cb failed! 0x%x", err);
  }

  TinyUSBDevices.wireless_mode = WIRELESS_MODE::ENABLE_ESP_NOW_TO_DONGLE;
}

/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////

// ===================================================================================
// HANDSHAKE PROTOCOL: MACCHINA A STATI DI CONNESSIONE
// ===================================================================================
// Questa è l'implementazione della complessa danza di accoppiamento tra i dispositivi.
// La logica è asimmetrica: 
// - La GUN fa da "Faro" (Master) e spara pacchetti in broadcast sui vari canali.
// - Il DONGLE e il PEDAL fanno da "Ascoltatori" (Slave) in Promiscuous Mode.
// Una volta trovati, si scambiano i MAC Address (per passare dall'insicuro broadcast 
// a una comunicazione Unicast punto-a-punto) e le informazioni USB (Spoofing).

// ============ NUOVA IMPLEMNTAZIONE DONGLE == LA GUN FA IL FARO ================================
#ifdef DONGLE
bool SerialWireless_::connection_dongle() {
#if defined(DONGLE) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandleLink = NULL;
#endif
    
  #if defined(DONGLE) && defined(USES_DISPLAY)
  if(display_init) {
  // Avvio animazione
    if (animTaskHandleLink == NULL) {
      xTaskCreatePinnedToCore(
        animTaskLink,          // funzione del task
        "AnimTaskLink",        // nome
        4096,              // stack size
        NULL,              // parametri
        1,                 // priorità
        &animTaskHandleLink,   // handle
        APP_CPU_NUM        // core (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY

  #define TIMEOUT_DONGLE_DIALOGUE 2000 //  1000 // in millisecondi   ?????????????????????????
  unsigned long lastMillis_start_dialogue = millis ();
  
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    
  // ====================================================

  // FASE 1: ATTESA DEL FARO
  // Il Dongle apre le porte per accettare i pacchetti Broadcast della Gun
  broadcast_receiver = true;

#if defined(DONGLE) && defined(USES_OLED_DISPLAY)
  unsigned long dongle_oled_last_poll = 0;
#endif

  while(stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) { 
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      lastMillis_start_dialogue = millis ();
    }
    // Timeout di Sicurezza: Se la Gun sparisce a metà handshake, resettiamo lo stato
    if (((millis() - lastMillis_start_dialogue) > TIMEOUT_DONGLE_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
      stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    }
#if defined(DONGLE) && defined(USES_OLED_DISPLAY)
    if (millis() - dongle_oled_last_poll >= 150UL) {
      dongle_oled_last_poll = millis();
      dongle_oled_draw_link_status();
    }
#endif
    taskYIELD();
  }
  
  // FASE 2: UNICAST LOCK-IN
  // Connessione stabilita. Chiudiamo le porte al broadcast per sicurezza e per 
  // alleggerire il carico CPU sulla ricezione di pacchetti vaganti.
  broadcast_receiver = false;

  //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");
  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // cancella il broadcast dai peer
    //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
  }
  
  // Registriamo la Gun come unico peer valido per la comunicazione
  memcpy(peerAddress, mac_esp_another_card, 6);
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserisce il dongle nei peer
    //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

  
  TinyUSBDevices.onBattery = true;
  
    #if defined(DONGLE) && defined(USES_DISPLAY)
      if (animTaskHandleLink != NULL) {
        vTaskDelete(animTaskHandleLink);
        animTaskHandleLink = NULL;
      }
    #endif // USES_DISPLAY
  
  return true; 
}
#endif // DONGLE
// ============ FINE NUOVA IMPLEMNTAZIONE DONGLE == LA GUN FA IL FARO ================================

// ===================================================================================
// RICONNESSIONE RAPIDA (FAST RECOVERY)
// ===================================================================================
// Funzioni utilizzate per riprendere la comunicazione senza dover rifare tutta
// la lenta procedura di Handshake. Se i dispositivi conoscono già i rispettivi 
// MAC Address (es. salvati in EEPROM/Flash in futuro), "bussano" direttamente 
// alla porta specifica.

#ifdef GUN
bool SerialWireless_::connection_gun_at_last_dongle() {
  #define TIMEOUT_TX_PACKET_LAST_DONGLE 300 // in millisecondi - tempo di invio pacchetti ogni millisecondi quindi 4-5 pacchetti
  #define TIMEOUT_DIALOGUE_LAST_DONGLE 2000 // in millisecondi - tempo massimo per ricerca ultimo dongle
  unsigned long lastMillis_tx_packet_last_dongle = 0;
  unsigned long lastMillis_start_dialogue_last_dongle = millis ();

  uint8_t aux_buffer_tx[13];
  
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION_DONGLE;
  aux_buffer_tx[0] = CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_DONGLE;
  memcpy(&aux_buffer_tx[1], SerialWireless.mac_esp_inteface, 6);
  memcpy(&aux_buffer_tx[7], peerAddress, 6);
  while (!TinyUSBDevice.mounted() && 
         (stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_DONGLE) &&
         ((millis() - lastMillis_start_dialogue_last_dongle) < TIMEOUT_DIALOGUE_LAST_DONGLE)) { 
      if ((millis() - lastMillis_tx_packet_last_dongle) > TIMEOUT_TX_PACKET_LAST_DONGLE)
      {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer_tx, 13, PACKET_TX::CHECK_CONNECTION_LAST_DONGLE); 
        lastMillis_tx_packet_last_dongle = millis();
      }
      
      taskYIELD();
  }
  if (stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_DONGLE) {    
    stato_connessione_wireless = CONNECTION_STATE::DEVICES_CONNECTED;
    TinyUSBDevices.onBattery = true;
    return true;
  } else {
    // Fallimento Fast Recovery: prepariamo il terreno per il Full Handshake.
    stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
    lastDongleSave=false;
    esp_now_deinit();
    begin();
    return false;
  }
}
#endif // GUN

#ifdef GUN
bool SerialWireless_::connection_gun_at_last_pedal() {
  #define TIMEOUT_TX_PACKET_LAST_PEDAL 300 // in millisecondi - tempo di invio pacchetti ogni millisecondi quindi 4-5 pacchetti
  #define TIMEOUT_DIALOGUE_LAST_PEDAL 2000 // in millisecondi - tempo massimo per ricerca ultimo pedal
  unsigned long lastMillis_tx_packet_last_pedal = 0;
  unsigned long lastMillis_start_dialogue_last_pedal = millis ();
  uint8_t aux_buffer_tx[13];
  
  // =============================================
  uint8_t peerAddress_copy[6]; 
  memcpy(peerAddress_copy, peerAddress, 6);

  memcpy(peerAddress, lastPedalAddress, 6);        
  memcpy(peerInfo.peer_addr, peerAddress, 6);
  peerInfo.channel = espnow_wifi_channel;
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserisce il dongle nei peer
    //Serial.println("Errore nell'aggiunta del nuovo peer");
  } else esp_now_set_peer_rate_config(peerAddress, &rate_config);         
  // =============================================

  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION_PEDAL;
  aux_buffer_tx[0] = CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_PEDAL;
  memcpy(&aux_buffer_tx[1], SerialWireless.mac_esp_inteface, 6);
  memcpy(&aux_buffer_tx[7], peerAddress, 6);
  while ((stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED_WITH_LAST_PEDAL) &&
         ((millis() - lastMillis_start_dialogue_last_pedal) < TIMEOUT_DIALOGUE_LAST_PEDAL)) { 
      if ((millis() - lastMillis_tx_packet_last_pedal) > TIMEOUT_TX_PACKET_LAST_PEDAL)
      {
        SerialWireless.SendPacket((const uint8_t *)aux_buffer_tx, 13, PACKET_TX::CHECK_CONNECTION_LAST_PEDAL); 
        lastMillis_tx_packet_last_pedal = millis();
      }
      
      taskYIELD();
  }
  
  if (esp_now_del_peer(peerAddress) != ESP_OK) {  // cancella il broadcast dai peer
      //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
  }

  memcpy(peerAddress, peerAddress_copy, 6);

