wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
  stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
  
  broadcast_receiver = true;

  while (stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
    if (stato_connessione_wireless == CONNECTION_STATE::NONE_CONNECTION) {
      if (((millis() - lastMillis_change_channel) > TIMEOUT_PEDAL_CHANGE_CHANNEL)) { 
         
        esp_wifi_set_promiscuous(true);
        if (esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE) != ESP_OK) {
          //Serial.printf("DONGLE - esp_wifi_set_channel failed!");
        }
        esp_wifi_set_promiscuous(false);
        
        espnow_wifi_channel = channel;
        
        peerInfo.channel = channel;  // si potrebbe anche impostare sempre a 0 che usa quello del wifi
        if (esp_now_mod_peer(&peerInfo) != ESP_OK) {  // modifica il canale del peer
          //Serial.println("DONGLE - Errore nella modifica del canale");
        }             
        lastMillis_change_channel = millis ();
        
        
        channel++;
        if (channel >13) channel = 1;
      }
      
      lastMillis_start_dialogue = millis();
    }
    else {
      if (((millis() - lastMillis_start_dialogue) > TIMEOUT_PEDAL_DIALOGUE) && stato_connessione_wireless != CONNECTION_STATE::DEVICES_CONNECTED) {
        stato_connessione_wireless = CONNECTION_STATE::NONE_CONNECTION;
        //Serial.println("DONGLE - Non si è conclusa la negoziazione tra DONGLE/GUN e si riparte da capo");
        lastMillis_change_channel = millis ();
      }  
    }
    taskYIELD();
  }
    
  broadcast_receiver = false;
    
    //Serial.println("DONGLE - Negosazione completata - associazione dei dispositivi GUN/DONGLE");
    if (esp_now_del_peer(peerAddress) != ESP_OK) {  // cancella il broadcast dai peer
      //Serial.println("DONGLE - Errore nella cancellazione del peer broadcast");
    }
    memcpy(peerAddress, mac_esp_another_card, 6);
    memcpy(peerInfo.peer_addr, peerAddress, 6);
    espnow_wifi_channel=usb_data_wireless.channel;
    esp_wifi_set_promiscuous(true);
    esp_wifi_set_channel(espnow_wifi_channel, WIFI_SECOND_CHAN_NONE);
    esp_wifi_set_promiscuous(false);
    peerInfo.channel = espnow_wifi_channel;
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {  // inserisce il dongle nei peer
      //Serial.println("DONGLE - Errore nell'aggiunta del nuovo peer della GUN");
    } else esp_now_set_peer_rate_config(peerAddress, &rate_config);

  
    TinyUSBDevices.onBattery = true;
    return true;  
      
}
#endif // PEDAL
// ======================= FINE IMPLEMENTAZIONE PEDAL - RIMANE IN ASCOLTO SU TUTTI I CANALI ===============

// ===================================================================================
// CALLBACK LEVEL: DECODIFICA DEI PACCHETTI RICEVUTI
// ===================================================================================
// Questo blocco contiene il cervello del parsing. In base al target (#ifdef)
// i pacchetti vengono smistati verso funzioni diverse (es. il Dongle invierà
// l'HID Report al PC, mentre la Gun decodificherà il Force Feedback per muovere i motori).
// Viene eseguito in un task (non in interrupt) ma deve comunque essere velocissimo.

// ======================= CALLBACK PACKET DONGLE =========================================
#ifdef DONGLE
void packet_callback_read_dongle() {
  switch (SerialWireless.packet.currentPacketID()) {
    case PACKET_TX::SERIAL_TX:
      Serial.write(&SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      Serial.flush();
      break;
    case PACKET_TX::MOUSE_TX : {
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];
      if (memcmp(ptr, &absmouse5Report_last_wifi, sizeof(absmouse5Report_last_wifi))) {
        memcpy(&absmouse5Report_last_wifi, ptr, sizeof(absmouse5Report_last_wifi));
        absmouse5Report_pending = true;    
        xTaskNotifyGive(xUSBTaskHandle);
      }
      break;
    }
    case PACKET_TX::GAMEPADE_TX: {
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];
      // --- GAMEPAD ---
      if (memcmp(ptr, &gamepad16Report_last_wifi, sizeof(gamepad16Report_last_wifi))) {
        memcpy(&gamepad16Report_last_wifi, ptr, sizeof(gamepad16Report_last_wifi));
        gamepad16Report_pending = true;
        xTaskNotifyGive(xUSBTaskHandle);
      }
      break;
    }
    case PACKET_TX::KEYBOARD_TX: {
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];
      if (memcmp(ptr, &keyReport_last_wifi, sizeof(keyReport_last_wifi))) {
        memcpy(&keyReport_last_wifi, ptr, sizeof(keyReport_last_wifi));
        keyReport_pending = true;
        xTaskNotifyGive(xUSBTaskHandle);
      }
      break;
    }
    // ====== poi va tolto ================
    case PACKET_TX::PEDAL_TX:
      {
        SerialWireless.is_pedal_wireless_comunication = true;
      }
      break;
    // ====== fine poi va tolto  
    #ifdef OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    case PACKET_TX::MOUSE_KEY_PAD_TX: { // ATTENZIONE: Le parentesi graffe qui sono OBBLIGATORIE in C++ per dichiarare variabili dentro un 'case'
      
      uint8_t* ptr = &SerialWireless.packet.rxBuff[PREAMBLE_SIZE];

      // Always apply composite HID payload: memcmp-only skips updates if struct
      // padding or host/dongle layout ever diverges, breaking mouse buttons.
      memcpy(&absmouse5Report_last_wifi, ptr, sizeof(absmouse5Report_last_wifi));
      absmouse5Report_pending = true;
      ptr += sizeof(absmouse5Report_last_wifi);

      memcpy(&keyReport_last_wifi, ptr, sizeof(keyReport_last_wifi));
      keyReport_pending = true;
      ptr += sizeof(keyReport_last_wifi);

      memcpy(&gamepad16Report_last_wifi, ptr, sizeof(gamepad16Report_last_wifi));
      gamepad16Report_pending = true;

      xTaskNotifyGive(xUSBTaskHandle);

      break;  
    }
    #endif // OPENFIRE_USE_ESPNOW_UNIFIED_PACKET
    case PACKET_TX::CHECK_CONNECTION_LAST_DONGLE:
      memcpy(aux_buffer, &SerialWireless.packet.rxBuff[PREAMBLE_SIZE], SerialWireless.packet.bytesRead);
      switch (aux_buffer[0])
      {
      case CONNECTION_STATE::TX_CHECK_CONNECTION_LAST_DONGLE:
        if ((memcmp(&aux_buffer[1],peerAddress,6) == 0) && 
           (memcmp(&aux_buffer[7],SerialWireless.mac_esp_inteface,6) == 0) &&
           SerialWireless.stato_connessione_wireless == CONNECTION_STATE::DEVICES_CONNECTED) { 
              aux_buffer[0] = CONNECTION_STATE::TX_CONFERM_CONNECTION_LAST_DONGLE; 
              memcpy(&aux_buffer[1], SerialWireless.mac_esp_inteface, 6);
              memcpy(&aux_buffer[7], peerAddress, 6);
              
