wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
    // COPIA BATCH
    if (firstChunk < len) {
      // Caso a capo: dobbiamo dividere la copia in due
      uint16_t secondChunk = len - firstChunk;
      memcpy(SerialWireless._queue + w, data, firstChunk);
      memcpy(SerialWireless._queue, data + firstChunk, secondChunk);
    } 
    else {
      // Caso lineare: copia singola
      memcpy(SerialWireless._queue + w, data, len);
    }

    // --- BARRIERA DI MEMORIA ---
    // Fondamentale: garantisce che la RAM abbia salvato i dati della memcpy 
    // PRIMA di segnalare al task che ci sono nuovi dati disponibili.
    asm volatile ("memw" : : : "memory");

    // 5. Aggiornamento ATOMICO del solo indice _writer
    // Nessun lock necessario! Appena questa riga viene eseguita, 
    // il task (che sta guardando _writer) vede magicamente apparire i nuovi dati.
    SerialWireless._writer = (w + len) & MASK;
    
    // ADDIO SerialWireless._readLen!
  } 
  else {
    // Spazio insufficiente (o pacchetto scartato per evitare l'incrocio dei puntatori)
    SerialWireless._overflow_read = true;
  }

  // 6. Notifica Task (Campanello invariato)
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  vTaskNotifyGiveFromISR(xRadioTaskHandle, &xHigherPriorityTaskWoken);
  if (xHigherPriorityTaskWoken) {
    portYIELD_FROM_ISR();
  }
}

// CALLBACK SPEDIZIONE ESP-NOW
static void _esp_now_tx_cb(const esp_now_send_info_t *tx_info, esp_now_send_status_t status) { 
  // 1. Liberiamo la radio per il prossimo pacchetto
  radioFree = true;

  // 2. Controllo Lock-Free: Il buffer TX ha ancora dati da spedire?
  if (SerialWireless.writeIndex != SerialWireless.readIndex) {   
    
    // 3. Svegliamo il radioTask per fargli svuotare il resto
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    vTaskNotifyGiveFromISR(xRadioTaskHandle, &xHigherPriorityTaskWoken);
    
    if (xHigherPriorityTaskWoken) {
      portYIELD_FROM_ISR();
    }
  }
}
// =================== FINE CALLBACK DI RICEZIONE ED INVIO DI ESP-NOW ========================


// ===================================================================================
// HARDWARE TIMERS (SERIALE E PEDALE)
// ===================================================================================
// L'uso di esp_timer (alta risoluzione hardware) invece di delay() o millis() 
// garantisce un'esecuzione prioritaria e precisa, essenziale per sbloccare la 
// seriale intasata o per dichiarare un pedale "morto" se si perdono pacchetti.

// ================================== TIMER PER SERIALE ===================================
// CALLBACK per timer Serial

void timer_callback_serial(void* arg) {
  while (SerialWireless.availableBufferSerialWrite() > 0) {
    if (!SerialWireless.flush_sem()) {
      // LA RADIO È PIENA! Il timer non può fare yield.
      // Chiediamo aiuto al radioTask per quando si libererà spazio.
      SerialWireless._serial_needs_recovery = true; 
      break; 
    }
  }
}

void SerialWireless_::setupTimerSerial() {
    esp_timer_create_args_t timer_args = {
        .callback = &timer_callback_serial,
        .arg = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "timer_serial"
    };
    
    esp_timer_create(&timer_args, &timer_handle_serial);
}


// ==========================   FINE TIMER PER SERIALE ====================================


// ================================== TIMER PER PEDAL ===================================
// CALLBACK per timer Pedal
void timer_callback_pedal(void* arg) {
  
  TinyUSBDevices.pedals_wireless_state = 0;
 
}

void setupTimerPedal() {
    esp_timer_create_args_t timer_args = {
        .callback = &timer_callback_pedal,
        .arg = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "timer_pedal"
    };
    
    esp_timer_create(&timer_args, &timer_handle_pedal);
}
// ======================== FINE TIMER PER PEDAL =============================

// ===================================================================================
// CALLBACK DI SISTEMA: TINYUSB
// ===================================================================================

// ============ CALLBACK PER SPEDIZIONE TINYUSB =============================
#ifdef DONGLE
// NON VA DEFINITA IN QUANTO SOSTITUISCE QUELLA DI DEFAULT CHE NON FA NULLA (e' gia' definita dentro la libreria tinyUSB)
#ifdef __cplusplus
extern "C" {
#endif

// Questa callback viene invocata dal driver USB a basso livello ogni volta che 
// il PC "assorbe" i dati HID inviati dal Dongle. Noi la intercettiamo per
// risvegliare l'usbTask e inviare immediatamente il pacchetto successivo.
void tud_hid_report_complete_cb(uint8_t instance, uint8_t const* report, uint16_t len) {
    // Il PC ha appena liberato il buffer. Svegliamo usbTask!
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    vTaskNotifyGiveFromISR(xUSBTaskHandle, &xHigherPriorityTaskWoken);
    if (xHigherPriorityTaskWoken) {
        portYIELD_FROM_ISR();
    }
}

#ifdef __cplusplus
}
#endif

#endif // DONGLE
// ============ FINE CALLBACK PER SPEDIZIONE TINYUSB =============================


#endif //OPENFIRE_WIRELESS_ENABLE